Repository: rfrasur/SubjectsPlus
Catalog: translations/messages.*.xlf
Languages: es

source: New Guides
es: Guías nuevas

source: Guide Collections
es: Colleciones de guías

source: %type% Guides
es: Guías de %type%

source: Home
es: Inicio

source: Guides
es: Guías

source: Databases
es: Recursos Electrónicos

source: Staff list
es: Directorio

source: FAQs
es: Preguntas más frecuentes

source: Talkback
es: Comentarios

source: Research Guides
es: Guías de Recursos

source: New Databases
es: Recursos nuevos

source: Trial Databases
es: Recursos bajo consideración
